app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `amos`
SELECT COUNT(*) AS `numrows`
FROM `mascotas`
---
    public function index(): string
    {
        $modelA = new \App\Models\AmoModel();
        $totalA = $modelA->countAllResults();

        $modelM = new \App\Models\MascotaModel();
        $totalM =  $modelM->countAllResults();

SELECT *
FROM `mascotas`
SELECT *
FROM `veterinarios`
SELECT *
FROM `mascotas`
WHERE `f_def` = ''
SELECT *
FROM `veterinarios`
WHERE `f_egreso` = ''
---
    public function mostrar() {
        $amoM = new \App\Models\AmoModel();
        $mascotaM = new \App\Models\MascotaModel();
        $vetM = new \App\Models\VeterinarioModel();
        $relM = new \App\Models\RelacionAMModel();

        $filtro = $this->request->getGet('filtro') ?? 'mascotas';
        $data = [
            'amos' => $amoM->findAll(),
            'mascotas' => $mascotaM->findAll(),
            'veterinarios' => $vetM->findAll(),
            /* Solo mascotas no fallecidas para el dropdown y listado general
            'mascotas' => $mascotaM->where('f_def', '')->findAll(),
            'veterinarios' => $vetM->where('f_egreso', '')->findAll(),